In [1]:
import pandas as pd
import numpy as np
import datetime 
import pandas_datareader.data as web
import matplotlib.pyplot as plt
import pandas_datareader as pdr

The excel files downloaded via Bloomberg terminal in Erasmus University. Retrieving data, such as Brent Crude Oil, was done by FRED website.
Five factors are chosen through Vector Auto Regressive(VAR) models. Economically meaningful and statistically significants are main reasons to choose the factors.

In [2]:
start='2001-01-01'
end='2018-01-18'

In [3]:
# Import futures data
R_f = pd.read_excel('Rob_future.xlsx', index_col=0)
# making ascending
R_f=R_f.sort_index(ascending=True)
print(R_f.head(10))

             Close
Date
2008-12-31  2906.0
2009-01-02  2989.0
2009-01-05  2951.0
2009-01-06  3145.0
2009-01-07  3098.0
2009-01-08  3096.0
2009-01-09  3196.0
2009-01-12  3130.0
2009-01-13  3100.0
2009-01-14  3079.0

In [4]:
# importing Old data
brent = web.DataReader("DCOILBRENTEU",'fred',start, end)
print(brent.tail())

            DCOILBRENTEU
DATE
2018-01-12         69.64
2018-01-15         70.31
2018-01-16         69.40
2018-01-17         69.19
2018-01-18         69.48

In [5]:
# making clean data and put it on the price data
# wti = wti.fillna(method='ffill')
R_f['Brent'] = brent['DCOILBRENTEU']

In [6]:
# getting inventories data
inven = pd.read_excel('C_Inven.xlsx',index_col=0)
inven=inven.sort_index(ascending=True)
# inven = inven.dropna(axis=0, how='any')
print(inven.tail())

            C_Inven
Date
2018-01-26    1.979
2018-01-29    1.967
2018-01-30    1.965
2018-01-31    1.970
2018-02-01    1.964

In [7]:
R_f['C_Inven'] = inven['C_Inven']
print(R_f.head())

             Close  Brent  C_Inven
Date
2008-12-31  2906.0  35.82      NaN
2009-01-02  2989.0  42.94    4.407
2009-01-05  2951.0  45.84    4.400
2009-01-06  3145.0  48.89    4.402
2009-01-07  3098.0  46.23    4.390

In [8]:
alldata = pd.read_excel('alldata.xlsx', index_col=0)
print(alldata.head())

            Robusta  Ara_Brazil
Date
2018-01-18    89.79      122.78
2018-01-17    89.79      122.78
2018-01-16    87.85      120.17
2018-01-15    87.93      121.64
2018-01-12    88.24      121.29

In [9]:
R_f['Ara_Brazil'] = alldata['Ara_Brazil']
R_f.head()

             Close  Brent  C_Inven  Ara_Brazil
Date
2008-12-31  2906.0  35.82      NaN         NaN
2009-01-02  2989.0  42.94    4.407      102.19
2009-01-05  2951.0  45.84    4.400      100.14
2009-01-06  3145.0  48.89    4.402      106.92
2009-01-07  3098.0  46.23    4.390      107.61

In [10]:
R_f = R_f.fillna(method='ffill')
R_f.head()

             Close  Brent  C_Inven  Ara_Brazil
Date
2008-12-31  2906.0  35.82      NaN         NaN
2009-01-02  2989.0  42.94    4.407      102.19
2009-01-05  2951.0  45.84    4.400      100.14
2009-01-06  3145.0  48.89    4.402      106.92
2009-01-07  3098.0  46.23    4.390      107.61

In [11]:
writer = pd.ExcelWriter('all_future.xlsx')
R_f.to_excel(writer,'Sheet1')
writer.save()

In [12]:
R_f_e = pd.read_excel('all_future.xlsx', index_col=0)
R_f_e.head()

            Close  Brent  C_Inven  Ara_Brazil
Date
2008-12-31   2906  35.82      NaN         NaN
2009-01-02   2989  42.94    4.407      102.19
2009-01-05   2951  45.84    4.400      100.14
2009-01-06   3145  48.89    4.402      106.92
2009-01-07   3098  46.23    4.390      107.61

During the seminar, my group used Vector Auto Regressive(VAR) models. So, constructing return data was essential.

In [13]:
R_f_e = np.log(R_f_e).diff().dropna()
R_f_e.head()

               Close     Brent   C_Inven  Ara_Brazil
Date
2009-01-05 -0.012795  0.065353 -0.001590   -0.020265
2009-01-06  0.063670  0.064416  0.000454    0.065512
2009-01-07 -0.015057 -0.055944 -0.002730    0.006433
2009-01-08 -0.000646 -0.073825 -0.000228   -0.005965
2009-01-09  0.031789 -0.014072 -0.003881    0.028114

In [14]:
currency = pd.read_excel('currency.xlsx', index_col=0)
currency=currency.sort_index(ascending=True)
print(currency.head())

            Currency
Date
2009-01-01       NaN
2009-01-02 -0.001506
2009-01-05 -0.006053
2009-01-06 -0.005477
2009-01-07  0.003061

In [15]:
R_f_e['Currency'] = currency['Currency']
print(R_f_e.head())

               Close     Brent   C_Inven  Ara_Brazil  Currency
Date
2009-01-05 -0.012795  0.065353 -0.001590   -0.020265 -0.006053
2009-01-06  0.063670  0.064416  0.000454    0.065512 -0.005477
2009-01-07 -0.015057 -0.055944 -0.002730    0.006433  0.003061
2009-01-08 -0.000646 -0.073825 -0.000228   -0.005965  0.007221
2009-01-09  0.031789 -0.014072 -0.003881    0.028114 -0.003043

In [16]:
R_f_e = R_f_e.dropna(axis=0, how='any')
R_f_e.head()

               Close     Brent   C_Inven  Ara_Brazil  Currency
Date
2009-01-05 -0.012795  0.065353 -0.001590   -0.020265 -0.006053
2009-01-06  0.063670  0.064416  0.000454    0.065512 -0.005477
2009-01-07 -0.015057 -0.055944 -0.002730    0.006433  0.003061
2009-01-08 -0.000646 -0.073825 -0.000228   -0.005965  0.007221
2009-01-09  0.031789 -0.014072 -0.003881    0.028114 -0.003043

In [17]:
writer = pd.ExcelWriter('all_future_return.xlsx')
R_f_e.to_excel(writer,'Sheet1')
writer.save()